[{"id":"5e405905c9fee","title":"KAALRAV 2k20 is Coming!!","body":"Whenever we hear something like a 'fest', we immerse ourselves into the thoughts of alluring colourful lights, unstoppable music, DJs and VJs, and even savouring foods. We tend to bend our hunches towards competitions, huge crowds, and cultural diversities which indeed gifts you a massive package of memories.\r\nKnowing people, working with them and understanding them is like the crux of every fest. Interactions with different ideological personalities, add a bit more of the spice to your experience.\r\nBut that's not all that you get from a fest, there are a plenty of things that one learns while engulfing himself\/herself into a fest. So, we brought you a list of things that you take home, apart from memories when partaking in a fest.\r\nYou learn to get out of your comfort zone.\r\nFests mean, 'Few Earn Stages To Shine', which indeed tells us that fests provide a platform where you could enhance your socialising and communication skills. It is always the stage that we fear the most and the only way possible to curb this phobia is extensively indulging self into fests that push you to step on the stage.\r\nKnowing the neighbour.\r\nStudents these days are so much induced into social media that they don't observe the real-life relations. A fest, on the other hand, drives you to come out of your digital world and build deeper connections with someone, that you may know a little less. A fest encourages you to, 'interact with people around by putting your phone down'.\r\nExplore your leadership skills.\r\nFests are not always organised to give a prezzie of memories to students, it lends a great platform to enhance and explore your leading skills. Not everyone is a born leader but could eventually turn into one by constantly scratching at the edges.\r\nYou learn to spend quality time.\r\nThese days, life is becoming faster and faster. Everyone is running, either to make a living or in the hopes of development and growth. With such a routine, it is hard for students to build strong relations and spend some quality time with them.\r\nLooking for a fest?Kaalrav 2k20, could be the best.\r\nA fest that brings students from different states under the same roof and gives them a chance to compete with each other. The tech fest does not end with this, a lot of motivational speeches by some of the well-known personalities, are also knocking your doors. The fest is going to serve you a varied amount of events, both related to technology and management.","tag":"kaalrav,smit, 2020,fest","cat":"lifestyle","date":"10-Feb-2020","time":"12:39:57","author":"ADMIN","picture":""},{"id":"5e405ca6ad377","title":"SMIT Girl Scales New Height","body":"When the Indian Navy welcomed its first woman pilot, with Sub Lieutenant Shivangi taking control of an aircraft in another significant milestone for the country’s armed forces, it was also celebration time for the premier engineering college in Sikkim.\r\nAs Shivangi, 24, was given her wings and joined naval operations at the Kochi naval base on December 2, it was a proud moment for Sikkim Manipal Institute of Technology (SMIT) under Sikkim Manipal University (SMU). For the first woman pilot of Indian Navy is an alumnus of SMIT. Shivangi completed her B.Tech in Mechanical Engineering in 2016.\r\nBorn in the city of Muzaffarpur in Bihar, Shivangi was commissioned into the Indian Navy last year after her initial training. She completed her schooling from DAV Public school, Muzzafarpur before joining SMIT for B Tech course.\r\nShe will be flying the Dornier Do-228s surveillance aircraft of the Indian Navy which are used by the navy for transport and maritime reconnaissance, taking off and landing on the shore, rather than from an aircraft carrier.\r\nDuring her stay at SMIT, Shivangi showed excellent academic record and diligence. “Shivangi has not only done us and the country proud, she has broken the glass ceiling as far as the induction of women pilots in the Armed Forces, in this case, the Indian Navy. At SMIT, our focus is not just towards academics, but all-round development of our students. We teach the students to think differently and take up challenging projects and think out of the box when it comes to career choices. We believe in inculcating values of hard work, perseverance and dedication in our students,” Prof Dr. Ashis Sharma, Director SMIT, said. “Shivangi has set an example for all other girls, especially from Sikkim and the North-eastern region to take up challenging careers. We wish her more laurels in the future,” he added.\r\n","tag":"shivangi,first women in indian navy,smit,alumni,shivangi","cat":"lifestyle","date":"10-Feb-2020","time":"12:55:26","author":"ADMIN","picture":""},{"id":"5e405d31330f7","title":"SMIT To Organise Inter - School \/ College Quiz","body":"Sikkim Manipal Institute of Technology (SMIT) is organizing an inter-school\/junior college quiz competition on 1st November, 2019 at Pragjyoti ITA centre, Machkhowa, Guwahati. \r\nA large number of teams are going to take part in the event. Teams from Assam and neighbouring states will take part in the event. It will be a day long programme from 09:30 AM till 05:30 PM comprising two rounds, i.e., preliminary and final. After the preliminary round, six successful teams are going to play the final round. \r\nAll the finalist teams are going to be awarded. Prizes worth Rs. 1 lakh in total are to be distributed among the participants. \r\nDuring the closing ceremony on the same day, which will be held from 04:00 PM until 05:30 PM, three distinguished persons, who have dedicated their lives to the cause of education and literary works are going to be felicitated. \r\nFurther, details about the competition may be obtained from http:\/\/www.quiz.smitcampus.in.\r\nOrganizers have invited interested participants and audience to visit ITA Machkhowa Center on 1st November 2019, and to participate and witness the quiz cum felicitation programme.","tag":"smit,quiz","cat":"lifestyle","date":"10-Feb-2020","time":"02:45:29","author":"ADMIN","picture":null}]