[{"id":"5e405905c9fee","title":"KAALRAV 2k20 is Coming!!","body":"Whenever we hear something like a 'fest', we immerse ourselves into the thoughts of alluring colourful lights, unstoppable music, DJs and VJs, and even savouring foods. We tend to bend our hunches towards competitions, huge crowds, and cultural diversities which indeed gifts you a massive package of memories.\r\nKnowing people, working with them and understanding them is like the crux of every fest. Interactions with different ideological personalities, add a bit more of the spice to your experience.\r\nBut that's not all that you get from a fest, there are a plenty of things that one learns while engulfing himself\/herself into a fest. So, we brought you a list of things that you take home, apart from memories when partaking in a fest.\r\nYou learn to get out of your comfort zone.\r\nFests mean, 'Few Earn Stages To Shine', which indeed tells us that fests provide a platform where you could enhance your socialising and communication skills. It is always the stage that we fear the most and the only way possible to curb this phobia is extensively indulging self into fests that push you to step on the stage.\r\nKnowing the neighbour.\r\nStudents these days are so much induced into social media that they don't observe the real-life relations. A fest, on the other hand, drives you to come out of your digital world and build deeper connections with someone, that you may know a little less. A fest encourages you to, 'interact with people around by putting your phone down'.\r\nExplore your leadership skills.\r\nFests are not always organised to give a prezzie of memories to students, it lends a great platform to enhance and explore your leading skills. Not everyone is a born leader but could eventually turn into one by constantly scratching at the edges.\r\nYou learn to spend quality time.\r\nThese days, life is becoming faster and faster. Everyone is running, either to make a living or in the hopes of development and growth. With such a routine, it is hard for students to build strong relations and spend some quality time with them.\r\nLooking for a fest?Kaalrav 2k20, could be the best.\r\nA fest that brings students from different states under the same roof and gives them a chance to compete with each other. The tech fest does not end with this, a lot of motivational speeches by some of the well-known personalities, are also knocking your doors. The fest is going to serve you a varied amount of events, both related to technology and management.","tag":"kaalrav,smit, 2020,fest","cat":"lifestyle","date":"10-Feb-2020","time":"12:39:57","author":"ADMIN","picture":""},{"id":"5e405ca6ad377","title":"SMIT Girl Scales New Height","body":"When the Indian Navy welcomed its first woman pilot, with Sub Lieutenant Shivangi taking control of an aircraft in another significant milestone for the country’s armed forces, it was also celebration time for the premier engineering college in Sikkim.\r\nAs Shivangi, 24, was given her wings and joined naval operations at the Kochi naval base on December 2, it was a proud moment for Sikkim Manipal Institute of Technology (SMIT) under Sikkim Manipal University (SMU). For the first woman pilot of Indian Navy is an alumnus of SMIT. Shivangi completed her B.Tech in Mechanical Engineering in 2016.\r\nBorn in the city of Muzaffarpur in Bihar, Shivangi was commissioned into the Indian Navy last year after her initial training. She completed her schooling from DAV Public school, Muzzafarpur before joining SMIT for B Tech course.\r\nShe will be flying the Dornier Do-228s surveillance aircraft of the Indian Navy which are used by the navy for transport and maritime reconnaissance, taking off and landing on the shore, rather than from an aircraft carrier.\r\nDuring her stay at SMIT, Shivangi showed excellent academic record and diligence. “Shivangi has not only done us and the country proud, she has broken the glass ceiling as far as the induction of women pilots in the Armed Forces, in this case, the Indian Navy. At SMIT, our focus is not just towards academics, but all-round development of our students. We teach the students to think differently and take up challenging projects and think out of the box when it comes to career choices. We believe in inculcating values of hard work, perseverance and dedication in our students,” Prof Dr. Ashis Sharma, Director SMIT, said. “Shivangi has set an example for all other girls, especially from Sikkim and the North-eastern region to take up challenging careers. We wish her more laurels in the future,” he added.\r\n","tag":"shivangi,first women in indian navy,smit,alumni,shivangi","cat":"lifestyle","date":"10-Feb-2020","time":"12:55:26","author":"ADMIN","picture":""},{"id":"5e405d31330f7","title":"SMIT To Organise Inter - School \/ College Quiz","body":"Sikkim Manipal Institute of Technology (SMIT) is organizing an inter-school\/junior college quiz competition on 1st November, 2019 at Pragjyoti ITA centre, Machkhowa, Guwahati. \r\nA large number of teams are going to take part in the event. Teams from Assam and neighbouring states will take part in the event. It will be a day long programme from 09:30 AM till 05:30 PM comprising two rounds, i.e., preliminary and final. After the preliminary round, six successful teams are going to play the final round. \r\nAll the finalist teams are going to be awarded. Prizes worth Rs. 1 lakh in total are to be distributed among the participants. \r\nDuring the closing ceremony on the same day, which will be held from 04:00 PM until 05:30 PM, three distinguished persons, who have dedicated their lives to the cause of education and literary works are going to be felicitated. \r\nFurther, details about the competition may be obtained from http:\/\/www.quiz.smitcampus.in.\r\nOrganizers have invited interested participants and audience to visit ITA Machkhowa Center on 1st November 2019, and to participate and witness the quiz cum felicitation programme.","tag":"smit,quiz","cat":"lifestyle","date":"10-Feb-2020","time":"02:45:29","author":"ADMIN","picture":null},{"id":"5e407af0bf6b0","title":"A college is not only the buildings, infrastructures, campus","body":" libraries, and it can be stressful sometimes. But what makes students through the day is the desire to get a degree, the friendships and experiences which will pave way preparing them for the real world. #SMIT #college","tag":"college,life","cat":"opinion","date":"10-Feb-2020","time":"03:04:40","author":"ADMIN","picture":""},{"id":"5e407b2447f64","title":"The ‘Stressed Out’ College Student","body":" The term “stressed out” is one that many college students use to describe themselves. Some students use the term so much as to render it meaningless. When you say that you are “stressed out,” what are you saying about yourself? And, more to the point, what is it about your usual coping style that just isn’t working?\r\nStress is an individual’s response to the demand for change. On a college campus, you are continually bombarded with demands to change — your behavior, your academic performance, your career or major choice, your values. Faced with these demands, you may seek to resist changing yourself while also trying to manage the stress so that it does not manage you.\r\nIs all stress bad? Should you strive to stamp stress out of your life completely? The answer is no! Stress serves some very useful purposes in our lives. Did you know, for example, that stress is essential for learning? Research on learning and stress levels shows that learning takes place under conditions of moderate stress. So, your goal is not to do away with all of the stress you experience; your goal is to keep the stress level at a moderate level, neither so low that you are bored nor so high that you are overwhelmed.\r\nHow do you keep the stress level moderate and manageable? All of us use coping strategies to keep stress manageable. The best coping strategies are those that are not destructive but healthy ways to prevent stress from increasing or strategies for reducing tension when the stress level builds up beyond a moderate level.\r\nDestructive strategies to reduce stress include using tobacco, drinking alcohol to get drunk, and taking illegal drugs or overusing prescribed medications. All of these strategies can bring short-term relief but at a high cost to both the mind and body. One of the least effective strategies is to do nothing about a problem, thinking it will go away. Of course, it rarely does — the professor notes poor attendance, late papers, and missed exams, the insensitive friend becomes disrespectful and even abusive.\r\nOne of the healthiest ways to manage stress is to plan for stressful times, like course registration, midterms, and the end of the semester. Before those times come, build your support system of family, friends, and study partners. Try to lead a healthy life with good eating habits and regular sleep patterns.\r\nDuring times of stress, use tension relievers so you can continue to perform to the best of your ability. Work out your anger and frustration with physical activity. Talk with people who “feed” you emotionally. Meditate, read, or get in touch with your spirit through nature or your religious faith.\r\nSometimes, your usual coping strategies do not reduce your level of stress to manageable levels, your friends say you are starting to be a burden to them, or you may feel as if you are going crazy. That would be a time that you may want to talk with someone you can trust, like a coach, resident advisor, or counselor. Most colleges, however small, have a counseling center where you can talk about your concerns in confidence with a mental health professional ","tag":"life,college,depression","cat":"opinion","date":"10-Feb-2020","time":"03:05:32","author":"ADMIN","picture":""},{"id":"5e4081cec0610","title":"Olympian Sells Medal to Pay for Child's Cancer Treatment","body":" Polish discus thrower Piotr Malachowski won a silver medal in Rio. Almost immediately, however, he put that medal up for auction to help fund a cancer treatment for a three-year-old boy.\r\n\r\nAccording to ESPN's Darren Rovell, Malachowski's goal was to raise enough money to ensure Olek Szymanski \"could get surgery for his retinoblastoma in New York to try to save the child's eyesight.\"\r\n\r\nRovell reported that Polish foundation Siepomaga had raised about a third of the $126,000 needed for the surgery, and Malachowski hoped to raise the rest with the action.\r\n\r\nShortly after the auction began, Malachowski announced on Facebook, per Rovell, that a wealthy Polish couple had committed to covering the remaining amount required.\r\n\r\n\r\nhaun Barker's is a comeback story for the ages. In 2012, the English footballer—then with Derby County FC—collided with an opposing goalkeeper, causing every ligament and tendon in his knee to rupture.\r\n\r\nGregor Robertson of Mail Online wrote: \"To outsiders, the idea that he would ever return to play professional football again seemed ludicrous. And as time passed, that sentiment only grew.\"\r\n\r\nAfter four-plus years and five surgeries, however, Barker finally made his return to competitive football in August. Playing for a new club, Burton Albion FC, Barker entered as a substitute in the 93rd minute of a match against Derby.\r\n\r\nOf his appearance, Barker said, per Robertson: \"It's about proving myself again now. This has made me content but it's not made me happy.\"\r\n\r\n","tag":"olympics,runner,determination","cat":"sports","date":"10-Feb-2020","time":"03:33:58","author":"ADMIN","picture":""},{"id":"5e4082084c83d","title":"Son Joins Father on Coaching Staff","body":" Kendall Brest played football at Hickory High School in western Pennsylvania under his father, head coach Bill Brest.\r\n\r\nDuring his junior year, Kendall was diagnosed with a heart disorder and told he could no longer play football. Instead, he joined the Hickory coaching staff as a student assistant.  \r\n\r\nBill Brest said, per Chad Krispinsky of WKBN 27: \"He's putting the time and effort in, he's very talented. He has the health setback, but he's attacking it and he sees the big picture in life.\"\r\n\r\nKendall was also the guest of honor at a September game against rival Sharon High School, an event at which both schools worked to raise money for kids with heart-related health issues.  ","tag":"athelete,spirit,goals","cat":"sports","date":"10-Feb-2020","time":"03:34:56","author":"ADMIN","picture":""},{"id":"5e40abd9ddf8b","title":"Retracing the rich history of J&K","body":" In all the discussions and writings on Jammu and Kashmir (J&K), the Dogra factor is almost always neglected or passed over. The fact is that the state of J&K would not have come into existence had it not been for the formidable combination of diplomacy and valour shown by the Dogras under Maharaja Gulab Singh (1792-1858). A favourite general in the armies of Maharaja Ranjit Singh, he performed valiantly in several of the Sikh wars in Afghanistan. As a result, Maharaja Ranjit Singh bestowed upon him the title of the Raja of Jammu with a personal Raj Tilak, on the banks of the Chenab in 1822.\r\n\r\nThe Dogra factor in the creation and maintenance of the J&K state cannot, therefore, be minimised. This, apart from their outstanding continuing role in the Indian Army, and their cultural input through traditional dance, music and, of course, the world famous schools of pahari painting including Basohli, Guler and the Kangra miniatures. The Dogri language has also been included in the Eighth Schedule of the Constitution, and the Dogras, though numerically small, play a notable role in many spheres of public life.\r\n\r\nDespite the radical restructuring of the erstwhile J&K state recently, the Jammu and the Kashmir regions remain linked, albeit in a Union Territory (UT). In many ways, the economy of the two regions are mutually supportive. The bulk of tourists to the holy cave in Amarnath invariably travel through Jammu, while much of the horticultural and handicraft products of Kashmir pass through the Jammu markets. The fact that both regions have been reduced to a joint UT is not welcomed in either region. The Kashmiris feel that from enjoying a special status and Constitution, they have now been reduced to an even lower category than other Indian states, while the Dogras feel that considering the contribution they have made to extending and consolidating the northern frontiers of India, the least they can expect is the status of a full-fledged state along with regional autonomy for both units.","tag":"opinion, smit, j&k, kashmir","cat":"opinion","date":"10-Feb-2020","time":"06:33:21","author":"ADMIN","picture":""},{"id":"5e40b465a455f","title":"Why I Wake Up Early","body":" Okay, so while pursuing the internet as one does, I came across an article about why you should wake up early, this particular article covered the health benefits of waking up early. After reading it, I thought, huh? Maybe I should check into this a little further. \r\n\r\nSitting here today, I can say I have read several articles on why it’s better to wake up early. Frankly, some of them were just complete trash and others had some excellent points. An authority on the topic I am not, but I am going to share with you what waking up one hour just a mear 60 minutes earlier does for me. \r\n\r\nOkay, seeing honesty is the best policy you should know; typically, I woke up 45 minutes before having to leave for work. My clothes are laid out and my coffee is brewing by the time the alarm goes off. The routine was to jump in the shower, get dressed, pat the dog on the head, grab my backpack and coffee then hit the road. Sometime this would go smoothly, sometimes not so much. Okay, okay, oftentimes not so much. The commute, if you can even call it that, takes exactly six-minutes with traffic. This morning routine worked for me most of the time, but if the smallest hiccup happened, I would be thrown into a death spiral that most likely would consume my day. Now you may be thinking just get up 20 minutes earlier and that wouldn’t happen. You would probably be right to think that; I can only say it was what it was. The following are the five things I get to do with this found time. \r\n\r\nImagine if you will the alarm goes off. I jump out of bed, under no circumstance do I allow myself to hit the snooze. In the past, this only made me feel worse; those extra 5 minutes cost me dearly throughout the day. I then grab my coffee and drink it, sitting in my favorite chair. Now, this sounds simple, but this is what I call Mind Time. I am free to think about whatever I want or nothing at all. \r\n\r\nAfter coffee, I take my sweet Labradoodle JD on a walk around the block, something that would never have happened before. This being my Nature Time, personally, seeing the dew on the grass and hearing the birds chirp is soul repairing for me. Waving at the neighbors but not stopping to talk was nice too. I highly recommend a walk around the block, even if you don’t have a dog. \r\n\r\n\r\n\r\n","tag":"earlytobedearlytorise,morningbird","cat":"lifestyle","date":"10-Feb-2020","time":"07:09:49","author":"ADMIN","picture":""},{"id":"5e40b71038830","title":"The Injustice in College Sports","body":" Any fan of college sports loves this march madness time of the year. Those fans are also aware of other issues that pervade the NCAA system and are often featured in special reports alongside the tournament. The NCAA is a multi–billion dollar industry built atop a labor and celebrity force (college athletes) who are largely required to work for free. True, the athletes are usually playing as part of a scholarship program but that tradeoff represents a bygone era whose terms no longer make sense in this day and age.\r\n\r\nToday the most successful of college athletes will not even complete college before going pro yet the university, the NCAA and various corporate interests such as Nike, Adidas and Under Armor will make fortunes off the athlete’s name and efforts. The athletes themselves are forbidden any access to that fortune lest they forfeit their amateur status and rights to play in the NCAA.\r\n\r\n","tag":"athelete,spirit,goals","cat":"sports","date":"10-Feb-2020","time":"07:21:12","author":"ADMIN","picture":""}]